
//----------------------------------------------------------//
//                                                          //
//                        图像处理参数                        //
//                                                          //
//----------------------------------------------------------//
// #define SHOW_THRESH_WHOLE // 是否显示thresh后图像
// #define SHOW_COLOR              //是否显示通道相减后图像
// #define SHOW_INITIALIZED_IMAGE       //显示预处理操作之后的图像

// #define SHOW_FIRST_RESULT            //显示灯条识别结果
#define SHOW_TARGET_SHOT_ARMOR       //显示目标装甲板

// #define SHOW_ROI                     //显示ROI

//----------------------------------------------------------//
//                                                          //
//                      Terminal参数                        //
//                                                          //
//----------------------------------------------------------//


